config/cf/Catalogs/КатегорииБазыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>КатегорииБазыЗнаний</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКатегории</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКатегорийСтатейБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТип</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКатегорийБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/InformationRegisters/ИзбранноеБазыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ИзбранноеБазыЗнаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Создание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оповещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияБазыЗнаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/Enums/ТипыКатегорийСтатейБазыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыКатегорийСтатейБазыЗнаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приватная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Публичная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Enums/ВидыНовостейБазыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыНовостейБазыЗнаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/КатегорииБазыЗнаний/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ МОДУЛЯ

Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КатегорииОбновления = Новый Массив;
	Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
		КатегорииОбновления.Добавить(ЭтотОбъект.Родитель);
	КонецЕсли;
	Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
		РодительСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "Родитель");
		Если ЗначениеЗаполнено(РодительСсылка) Тогда
			КатегорииОбновления.Добавить(РодительСсылка);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтотОбъект.ЭтоНовый());
	ЭтотОбъект.ДополнительныеСвойства.Вставить("КатегорииОбновления", КатегорииОбновления);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ПометкаУдаленияСсылки", ?(ЭтотОбъект.ЭтоНовый(), Ложь, ЭтотОбъект.Ссылка.ПометкаУдаления));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("КатегорииОбновления")
		И ТипЗнч(ЭтотОбъект.ДополнительныеСвойства.КатегорииОбновления) = Тип("Массив")
		И ЭтотОбъект.ДополнительныеСвойства.КатегорииОбновления.Количество() > 0 Тогда
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Новый Структура("Категории", ЭтотОбъект.ДополнительныеСвойства.КатегорииОбновления));
		
		ФоновыеЗадания.Выполнить(
			"БазаЗнаний.ОбновитьСтатистикуКатегорий",
			МассивПараметров, ,
			"Обновление статистики по категориям");
	КонецЕсли;

	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		ДобавитьКатегориюВИзбранное();		
		ДобавитьНовостьБазыЗнаний(1);		
	КонецЕсли;
	
	ПометкаУдаленияСсылки = (ЭтотОбъект.ДополнительныеСвойства.Свойство("ПометкаУдаленияСсылки") И ЭтотОбъект.ДополнительныеСвойства.ПометкаУдаленияСсылки);
	Если ПометкаУдаленияСсылки <> ЭтотОбъект.ПометкаУдаления Тогда
		
		Если ЭтотОбъект.ПометкаУдаления Тогда
			ДобавитьНовостьБазыЗнаний(3);			
		Иначе
			ДобавитьНовостьБазыЗнаний(4);
		КонецЕсли;			
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ МЕТОДЫ

// ТипНовости: 1 - создание, 2 - изменение, 3 - удаление
Функция ДобавитьНовостьБазыЗнаний(ТипНовости)
	
	Если ЭтотОбъект.ТипКатегории = Перечисления.ТипыКатегорийСтатейБазыЗнаний.Приватная Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекПользователь		= Пользователи.ТекущийПользователь();
	
	ПараметрыСсылкиОтв	= Новый Структура("id", Строка(ТекПользователь.УникальныйИдентификатор()));
	АдресСсылкиОтв		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("user", ПараметрыСсылкиОтв);
	
	ПараметрыСсылкиКат	= Новый Структура("id", Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор()));
	АдресСсылкиКат		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("category", ПараметрыСсылкиКат);
	
	Если ТипНовости = 1 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Создание;
		Заголовок	= "Новая категория '%3'";
		ТекстHTML	= "<div>%1 в %2 добавлена новая категория базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Описание: " + СокрЛП(ЭтотОбъект.Описание) + "
		|	<br><a href='" + АдресСсылкиКат + "'>Перейти</a>
		|</div>";
	ИначеЕсли ТипНовости = 3 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Удаление;
		Заголовок	= "Удалена категория '%3'";
		ТекстHTML	= "<div>%1 в %2 удалена категория базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Описание: " + СокрЛП(ЭтотОбъект.Описание) + "
		|</div>";
	ИначеЕсли ТипНовости = 4 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Изменение;
		Заголовок	= "Восстановлена категория '%3'";
		ТекстHTML	= "<div>%1 в %2 восстановлена категория базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Описание: " + СокрЛП(ЭтотОбъект.Описание) + "
		|</div>";		
	КонецЕсли;
	
	ДатаНовости = ТекущаяДатаСеанса();
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДЛФ=DD"));
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДФ=HH:mm"));
	МассивПараметров.Добавить(СокрЛП(ЭтотОбъект.Наименование));
	МассивПараметров.Добавить(Строка(ТекПользователь));
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(Заголовок, МассивПараметров);
	ТекстHTML = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(ТекстHTML, МассивПараметров);
	
	ПараметрыНовости = Новый Структура;
	ПараметрыНовости.Вставить("Автор"				, ТекПользователь);
	ПараметрыНовости.Вставить("Заголовок"			, Заголовок);
	ПараметрыНовости.Вставить("ТекстHTML"			, ТекстHTML);
	ПараметрыНовости.Вставить("ОбъектБазыЗнаний"	, ЭтотОбъект.Ссылка);	
	ПараметрыНовости.Вставить("Важность"			, 2);
	ПараметрыНовости.Вставить("ВидНовости"			, ВидНовости);
	
	БазаЗнанийВызовСервера.ДобавитьНовость(ПараметрыНовости);
	
КонецФункции

Процедура ДобавитьКатегориюВИзбранное()
	
	МенеджерЗаписи = РегистрыСведений.ИзбранноеБазыЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь			= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.КатегорияБазыЗнаний	= ЭтотОбъект.Ссылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Пользователь			= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.КатегорияБазыЗнаний	= ЭтотОбъект.Ссылка;
	МенеджерЗаписи.Создание				= Истина;
	МенеджерЗаписи.Изменение			= Истина;
	МенеджерЗаписи.Удаление				= Истина;
	МенеджерЗаписи.Оповещение			= Истина;
	МенеджерЗаписи.Прочее				= Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
